#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_availability_zones.available: Reading...
module.nat.data.aws_ec2_instance_type.selected: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-02f71590ffce04a6d]
module.nat.data.aws_ec2_instance_type.selected: Read complete after 0s [id=t4g.nano]
module.nat.data.aws_ami.fck_nat: Reading...
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04c387144d0f7b1c3]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0c7d69b1ce54dc090]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d0823136d4d8684e]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-08368933c60282243]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0c9c6a3cb3c951e27]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06c4b56d1b75b8310]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-04da9a7dd058adaee]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0d938e60a6926f078]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-05b1659ce2fe16e2c]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0ac57b68b9ecc3021]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0cf27de01155493d6]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-08ff933fc0cd1a8ed]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-06708985e3206850f]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09570b4468b3fc794]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0d938e60a6926f0781080289494]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0b1443d53ffdace20]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-001198b7fde46da8f]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-022d83949d5645880]
module.nat.data.aws_subnet.selected: Reading...
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-07756c215d0f1ed17]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0762fa9cc0db44716]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0350dc3c543036138]
module.nat.data.aws_subnet.selected: Read complete after 0s [id=subnet-09570b4468b3fc794]
module.nat.data.aws_vpc.selected: Reading...
module.nat.data.aws_ami.fck_nat: Read complete after 1s [id=ami-0f57d652281755ea1]
module.nat.data.aws_vpc.selected: Read complete after 0s [id=vpc-02f71590ffce04a6d]
module.nat.aws_security_group.this: Refreshing state... [id=sg-07895f318fd3414de]
module.nat.aws_vpc_security_group_egress_rule.all: Refreshing state... [id=sgr-03c7a4c1e1ebbc3c4]
module.nat.aws_network_interface.this: Refreshing state... [id=eni-07da500abdb01794c]
module.nat.aws_vpc_security_group_ingress_rule.cidr_block: Refreshing state... [id=sgr-0d90f6c15fa02c5d2]
aws_route.nat["rtb-06c4b56d1b75b8310"]: Refreshing state... [id=r-rtb-06c4b56d1b75b83101080289494]
aws_route.nat["rtb-0c9c6a3cb3c951e27"]: Refreshing state... [id=r-rtb-0c9c6a3cb3c951e271080289494]
aws_route.nat["rtb-04da9a7dd058adaee"]: Refreshing state... [id=r-rtb-04da9a7dd058adaee1080289494]
module.nat.aws_launch_template.this: Refreshing state... [id=lt-024e9e160bf537bd6]
module.nat.aws_autoscaling_group.this: Refreshing state... [id=vpc-us-east-1-prd-nat]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.nat.aws_autoscaling_group.this has changed
  ~ resource "aws_autoscaling_group" "this" {
      + enabled_metrics                  = []
        id                               = "vpc-us-east-1-prd-nat"
        name                             = "vpc-us-east-1-prd-nat"
      + suspended_processes              = []
      + termination_policies             = []
        # (23 unchanged attributes hidden)

      + availability_zone_distribution {
          + capacity_distribution_strategy = "balanced-best-effort"
        }

        # (5 unchanged blocks hidden)
    }

  # module.nat.aws_launch_template.this has changed
  ~ resource "aws_launch_template" "this" {
        id                      = "lt-024e9e160bf537bd6"
        name                    = "vpc-us-east-1-prd-nat"
      + security_group_names    = []
        tags                    = {
            "environment" = "prd"
            "project"     = "aws-core-infra"
            "terraform"   = "true"
        }
      + vpc_security_group_ids  = []
        # (8 unchanged attributes hidden)

      ~ network_interfaces {
          + ipv4_addresses       = []
          + ipv4_prefixes        = []
          + ipv6_addresses       = []
          + ipv6_prefixes        = []
          + security_groups      = []
            # (7 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.nat.aws_network_interface.this has changed
  ~ resource "aws_network_interface" "this" {
        id                        = "eni-07da500abdb01794c"
        tags                      = {
            "Name"        = "vpc-us-east-1-prd-nat"
            "environment" = "prd"
            "project"     = "aws-core-infra"
            "terraform"   = "true"
        }
        # (23 unchanged attributes hidden)

      + attachment {
          + attachment_id = "eni-attach-002abe51e9a49c129"
          + device_index  = 0
          + instance      = "i-0cfddf8a14e3ff618"
        }
    }

  # module.nat.aws_security_group.this has changed
  ~ resource "aws_security_group" "this" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all traffic out of vpc-us-east-1-prd-nat security group"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-07895f318fd3414de"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "Allow all traffic from VPC CIDR block into vpc-us-east-1-prd-nat security group"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        name                   = "vpc-us-east-1-prd-nat"
        tags                   = {
            "Name"        = "vpc-us-east-1-prd-nat"
            "environment" = "prd"
            "project"     = "aws-core-infra"
            "terraform"   = "true"
        }
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.nat.aws_autoscaling_group.this must be replaced
-/+ resource "aws_autoscaling_group" "this" {
      ~ arn                              = "arn:aws:autoscaling:us-east-1:004351562122:autoScalingGroup:014c564b-36e1-4572-9fe9-7b656d2f90ce:autoScalingGroupName/vpc-us-east-1-prd-nat" -> (known after apply)
      - capacity_rebalance               = false -> null
      ~ default_cooldown                 = 300 -> (known after apply)
      - default_instance_warmup          = 0 -> null
      - enabled_metrics                  = [] -> null
      ~ health_check_type                = "EC2" -> (known after apply)
      ~ id                               = "vpc-us-east-1-prd-nat" -> (known after apply)
      ~ load_balancers                   = [] -> (known after apply)
      - max_instance_lifetime            = 0 -> null
      ~ name                             = "vpc-us-east-1-prd-nat" -> "vpc-us-east-1-prd-nat-asg" # forces replacement
      + name_prefix                      = (known after apply)
      ~ predicted_capacity               = 0 -> (known after apply)
      ~ service_linked_role_arn          = "arn:aws:iam::004351562122:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - suspended_processes              = [] -> null
      ~ target_group_arns                = [] -> (known after apply)
      - termination_policies             = [] -> null
      ~ vpc_zone_identifier              = [] -> (known after apply)
      ~ warm_pool_size                   = 0 -> (known after apply)
        # (11 unchanged attributes hidden)

      - availability_zone_distribution {
          - capacity_distribution_strategy = "balanced-best-effort" -> null
        }

      ~ launch_template {
          ~ id      = "lt-024e9e160bf537bd6" -> (known after apply)
          ~ name    = "vpc-us-east-1-prd-nat" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.nat.aws_iam_instance_profile.this will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "vpc-us-east-1-prd-nat-instance-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "vpc-us-east-1-prd-nat-role"
      + tags        = {
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
      + tags_all    = {
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
      + unique_id   = (known after apply)
    }

  # module.nat.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "vpc-us-east-1-prd-nat-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
      + tags_all              = {
          + "environment" = "prd"
          + "project"     = "aws-core-infra"
          + "terraform"   = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.nat.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonSSMManagedEC2InstanceDefaultPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedEC2InstanceDefaultPolicy"
      + role       = "vpc-us-east-1-prd-nat-role"
    }

  # module.nat.aws_launch_template.this must be replaced
-/+ resource "aws_launch_template" "this" {
      ~ arn                     = "arn:aws:ec2:us-east-1:004351562122:launch-template/lt-024e9e160bf537bd6" -> (known after apply)
      ~ default_version         = 1 -> (known after apply)
      - disable_api_stop        = false -> null
      - disable_api_termination = false -> null
      ~ id                      = "lt-024e9e160bf537bd6" -> (known after apply)
      ~ latest_version          = 1 -> (known after apply)
      ~ name                    = "vpc-us-east-1-prd-nat" -> "vpc-us-east-1-prd-nat-lt" # forces replacement
      + name_prefix             = (known after apply)
      - security_group_names    = [] -> null
        tags                    = {
            "environment" = "prd"
            "project"     = "aws-core-infra"
            "terraform"   = "true"
        }
      - vpc_security_group_ids  = [] -> null
        # (3 unchanged attributes hidden)

      + iam_instance_profile {
          + name = "vpc-us-east-1-prd-nat-instance-profile"
        }

      ~ metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          ~ http_put_response_hop_limit = 0 -> (known after apply)
          + instance_metadata_tags      = (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ network_interfaces {
          - device_index         = 0 -> null
          - ipv4_address_count   = 0 -> null
          - ipv4_addresses       = [] -> null
          - ipv4_prefix_count    = 0 -> null
          - ipv4_prefixes        = [] -> null
          - ipv6_address_count   = 0 -> null
          - ipv6_addresses       = [] -> null
          - ipv6_prefix_count    = 0 -> null
          - ipv6_prefixes        = [] -> null
          - network_card_index   = 0 -> null
          - security_groups      = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.nat.aws_network_interface.this will be updated in-place
  ~ resource "aws_network_interface" "this" {
      ~ description               = "vpc-us-east-1-prd-nat" -> "vpc-us-east-1-prd-nat-eni"
        id                        = "eni-07da500abdb01794c"
      ~ security_groups           = [
          - "sg-07895f318fd3414de",
        ] -> (known after apply)
        tags                      = {
            "Name"        = "vpc-us-east-1-prd-nat"
            "environment" = "prd"
            "project"     = "aws-core-infra"
            "terraform"   = "true"
        }
        # (21 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.nat.aws_security_group.this must be replaced
-/+ resource "aws_security_group" "this" {
      ~ arn                    = "arn:aws:ec2:us-east-1:004351562122:security-group/sg-07895f318fd3414de" -> (known after apply)
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all traffic out of vpc-us-east-1-prd-nat security group"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-07895f318fd3414de" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/16",
                ]
              - description      = "Allow all traffic from VPC CIDR block into vpc-us-east-1-prd-nat security group"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ name                   = "vpc-us-east-1-prd-nat" -> "vpc-us-east-1-prd-nat-sg" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "004351562122" -> (known after apply)
        tags                   = {
            "Name"        = "vpc-us-east-1-prd-nat"
            "environment" = "prd"
            "project"     = "aws-core-infra"
            "terraform"   = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # module.nat.aws_vpc_security_group_egress_rule.all must be replaced
-/+ resource "aws_vpc_security_group_egress_rule" "all" {
      ~ arn                    = "arn:aws:ec2:us-east-1:004351562122:security-group-rule/sgr-03c7a4c1e1ebbc3c4" -> (known after apply)
      ~ description            = "Allow all traffic out of vpc-us-east-1-prd-nat security group" -> "Allow all traffic out of vpc-us-east-1-prd-nat-sg"
      ~ id                     = "sgr-03c7a4c1e1ebbc3c4" -> (known after apply)
      ~ security_group_id      = "sg-07895f318fd3414de" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id = "sgr-03c7a4c1e1ebbc3c4" -> (known after apply)
        tags                   = {
            "environment" = "prd"
            "project"     = "aws-core-infra"
            "terraform"   = "true"
        }
        # (3 unchanged attributes hidden)
    }

  # module.nat.aws_vpc_security_group_ingress_rule.cidr_block must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "cidr_block" {
      ~ arn                    = "arn:aws:ec2:us-east-1:004351562122:security-group-rule/sgr-0d90f6c15fa02c5d2" -> (known after apply)
      ~ description            = "Allow all traffic from VPC CIDR block into vpc-us-east-1-prd-nat security group" -> "Allow all traffic from VPC CIDR block into vpc-us-east-1-prd-nat-sg"
      ~ id                     = "sgr-0d90f6c15fa02c5d2" -> (known after apply)
      ~ security_group_id      = "sg-07895f318fd3414de" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id = "sgr-0d90f6c15fa02c5d2" -> (known after apply)
        tags                   = {
            "environment" = "prd"
            "project"     = "aws-core-infra"
            "terraform"   = "true"
        }
        # (3 unchanged attributes hidden)
    }

Plan: 8 to add, 1 to change, 5 to destroy.

Warning: Most Recent Image Not Filtered

  with module.nat.data.aws_ami.fck_nat,
  on .terraform/modules/nat/terraform-aws-nat-instance/main.tf line 13, in data "aws_ami" "fck_nat":
  13: data "aws_ami" "fck_nat" {

"most_recent" is set to "true" and results are not filtered by owner or image
ID. With this configuration, a third party may introduce a new image which
will be returned by this data source. Consider filtering by owner or image ID
to avoid this possibility.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @mmccarthy404, Action: `pull_request`, Working Directory: ``, Workflow: `terraform-ci`*